ABOSTM/Arduino_Core_STM32/boards.txt
# Generic L4R9ZGJ board
GenL4.menu.pnum.GENERIC_L4R9ZGJ=Generic L4R9ZGJ
GenL4.menu.pnum.GENERIC_L4R9ZGJ.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGJ.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.board=GENERIC_L4R9ZGJ
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.variant=STM32L4xx/Generic_L4R9ZxJ

# Generic L4R9ZIJ board
GenL4.menu.pnum.GENERIC_L4R9ZIJ=Generic L4R9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZIJ.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIJ.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.board=GENERIC_L4R9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.variant=STM32L4xx/Generic_L4R9ZxJ

# Generic L4S5VI board
GenL4.menu.pnum.GENERIC_L4S5VI=Generic L4S5VI
GenL4.menu.pnum.GENERIC_L4S5VI.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5VI.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5VI.build.board=GENERIC_L4S5VI
GenL4.menu.pnum.GENERIC_L4S5VI.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5VI.build.variant=STM32L4xx/Generic_L4S5VI

# Upload menu
GenL4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL4.menu.upload_method.swdMethod.upload.protocol=0
GenL4.menu.upload_method.swdMethod.upload.options=-g
GenL4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=1
GenL4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=2
GenL4.menu.upload_method.dfuMethod.upload.options=-g
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Wraith32_V1 board
ESC_board.menu.pnum.Wraith32_V1=Wraith V1 ESC
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.Wraith32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.Wraith32_V1.build.board=Wraith32_V1
ESC_board.menu.pnum.Wraith32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.Wraith32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.Wraith32_V1.build.variant=STM32F0xx/WRAITH32_F051K6
ESC_board.menu.pnum.Wraith32_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=0
ESC_board.menu.upload_method.swdMethod.upload.options=-g
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=1
ESC_board.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=2
ESC_board.menu.upload_method.dfuMethod.upload.options=-g
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# LoRa boards

LoRa.name=LoRa boards
LoRa.build.core=arduino
LoRa.build.board=LoRa
LoRa.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# RAK811_TRACKER board
LoRa.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKER.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
LoRa.menu.pnum.RAK811_TRACKER.build.variant=STM32L1xx/RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.cmsis_lib_gcc=arm_cortexM3l_math

LoRa.menu.pnum.RAK811_TRACKERA=RAK811 LoRa Tracker (32kb RAM)
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_data_size=32768
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKERA.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKERA.build.board=RAK811_TRACKERA
LoRa.menu.pnum.RAK811_TRACKERA.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKERA.build.product_line=STM32L151xBA
LoRa.menu.pnum.RAK811_TRACKERA.build.variant=STM32L1xx/RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKERA.build.cmsis_lib_gcc=arm_cortexM3l_math

# RHF76_052 board
LoRa.menu.pnum.RHF76_052=RHF76 052
LoRa.menu.pnum.RHF76_052.upload.maximum_size=65536
LoRa.menu.pnum.RHF76_052.upload.maximum_data_size=8192
LoRa.menu.pnum.RHF76_052.build.mcu=cortex-m0plus
LoRa.menu.pnum.RHF76_052.build.board=RHF76_052
LoRa.menu.pnum.RHF76_052.build.series=STM32L0xx
LoRa.menu.pnum.RHF76_052.build.product_line=STM32L051xx
LoRa.menu.pnum.RHF76_052.build.variant=STM32L0xx/RHF76_052
LoRa.menu.pnum.RHF76_052.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.RHF76_052.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8=Elektor LoRa Node Core F072C8 (64kB)
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_size=65536
LoRa.menu.pnum.ELEKTOR_F072C8.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072C8.build.board=ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072C8.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072C8.build.variant=STM32F0xx/ELEKTOR_F072Cx
LoRa.menu.pnum.ELEKTOR_F072C8.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.ELEKTOR_F072C8.build.extra_flags=-D{build.product_line} {build.xSerial}

# ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB=Elektor LoRa Node Core F072CB (128kB)
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_size=131072
LoRa.menu.pnum.ELEKTOR_F072CB.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072CB.build.board=ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072CB.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072CB.build.variant=STM32F0xx/ELEKTOR_F072Cx
LoRa.menu.pnum.ELEKTOR_F072CB.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.ELEKTOR_F072CB.build.extra_flags=-D{build.product_line} {build.xSerial}

# Upload menu
LoRa.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
LoRa.menu.upload_method.swdMethod.upload.protocol=0
LoRa.menu.upload_method.swdMethod.upload.options=-g
LoRa.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

