ABOSTM/Arduino_Core_STM32/boards.txt
GenFlight.menu.rtlib.nano=Newlib Nano (default)
GenFlight.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenFlight.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenFlight.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenFlight.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenFlight.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenFlight.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenFlight.menu.rtlib.full=Newlib Standard
GenFlight.menu.rtlib.full.build.flags.ldspecs=

Garatronic.menu.rtlib.nano=Newlib Nano (default)
Garatronic.menu.rtlib.nanofp=Newlib Nano + Float Printf
Garatronic.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Garatronic.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Garatronic.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Garatronic.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Garatronic.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Garatronic.menu.rtlib.full=Newlib Standard
Garatronic.menu.rtlib.full.build.flags.ldspecs=

Midatronics.menu.rtlib.nano=Newlib Nano (default)
Midatronics.menu.rtlib.nanofp=Newlib Nano + Float Printf
Midatronics.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Midatronics.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Midatronics.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Midatronics.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Midatronics.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Midatronics.menu.rtlib.full=Newlib Standard
Midatronics.menu.rtlib.full.build.flags.ldspecs=
